{
  "hiImAnanias": "Hi, I’m Ananias",
  "fullStackDeveloper": "Full Stack Developer",
  "resume": "RESUME",
  "yearsExperience": "Years Experience",
  "portfolio": "Portfolio",
  "workExperience": "Work Experience",
  "aboutMe": "About me",
  "educationHistory": "Education History",
  "myExperience": "Work Experience",
  "skills": "Skills",
  "experiences": [
    {
      "title": "Full Stack Developer Freelancer",
      "period": "February 2024 – Present",
      "companyName": "",
      "companyDescription": "",
      "experienceDescription": "I added value by integrating E-Rede credit card payment methods for Elevar.",
      "skills": "Java Development, Node.js, Angular (Framework), AngularJS, SQL Server, Spring Boot, Git, GitLab."
    },
    {
      "title": "Full Stack Developer at Elevar",
      "period": "October 2022 – January 2024",
      "companyName": "Elevar Commerce",
      "companyDescription": "is a company that offers an e-commerce platform and solutions to help businesses expand and succeed online.",
      "experienceDescription": "I contributed to the development of personalized promotions, section banners working with Java, Angular, and SQL Server, created a freight microservice improving user experience using Node documented with Swagger, and enhanced software delivery processes through Merge Request pipelines.",
      "skills": "Application Programming Interface (API), Java, Ionic Framework, Node.js, Git, REST API, Continuous Integration and Continuous Delivery (CI/CD), AngularJS, Spring Boot, Angular (Framework), Microsoft SQL Server."
    },
    {
      "title": "Web Development Intern at Elevar",
      "period": "February 2022 – September 2022",
      "companyName": "Elevar Commerce",
      "companyDescription": "is a company that offers an e-commerce platform and solutions to help businesses expand and succeed online.",
      "experienceDescription": "As an intern, I experienced working with Agile Methodologies, code versioning, teamwork, and JavaScript and TypeScript technologies using Angular, Ionic, and Node, as well as Java on the backend.",
      "skills": "Java, Ionic Framework, Git, Angular (Framework), AngularJS, Microsoft SQL Server."
    }
  ],
  "educationalHistory": [
    {
      "title": "Distributed Software Architecture",
      "institution": "PUC Minas",
      "period": "March 2024 – Present",
      "educationDescription": "This course plays a strategic role in the professional training of those aiming for a career as a software architect. It is designed to provide skills and competencies for the advanced training of professionals involved in the conception, construction, and implementation of software using software architecture aspects in distributed environments."
    },
    {
      "title": "Bachelor's Degree in Computer Science",
      "institution": "Federal Institute of Education, Science and Technology of Ceará",
      "period": "2019 – 2023",
      "educationDescription": "The Bachelor's degree in Computer Science aims to train professionals with scientific, technical, ethical, and humanistic foundations, consistent with the specificities of the field of Computer Science, combined with practical training through project development and mastery of computational technologies. The Computer Science graduate works in areas related to entrepreneurship, research, consulting, public, private, and third sector organizations, and academic careers."
    },
    {
      "title": "Technical Degree in Information Technology",
      "institution": "EEEP Professora Luíza de Teodoro Vieira",
      "period": "2014 – 2016",
      "educationDescription": "The objective is to train mid-level professionals to work in the creation, production, and installation of communication and information technologies, integrating education, work, science, and technology. The training aims to promote continuous development, offering teaching situations that align labor skills with regional reality, enabling professionals to perform their activities efficiently. Additionally, it seeks to raise awareness about the importance of continuous training and enable the certification of professionally acquired knowledge for the continuation of studies."
    }
  ],
  "about-me-description": "From an early age, I have always been passionate about technology. At 13, watching my brother program, I dove into the world of IT and never looked back. Today, at 25 years old, I am a full stack developer, a journey I started in 2022 and embrace with enthusiasm and dedication. I hold a Bachelor's degree in Computer Science from IFCE and am currently pursuing a degree in Distributed Software Architecture at PUC Minas. Additionally, I am a certified IT technician, a foundation that solidified my love for programming from the very beginning. I love challenges and transforming real-world problems into coded solutions. My passion for solving complex dilemmas is evident in every project I undertake. Coffee is my constant companion, fueling my long hours of study and work. In my free time, I enjoy disconnecting by playing games with friends or watching basketball games, cheering passionately for my vibrant Boston Celtics"
}