{
  "hiImAnanias": "Olá, Eu sou Ananias",
  "fullStackDeveloper": "Desenvolvedor Full Stack",
  "resume": "CURRÍCULO",
  "yearsExperience": "Anos de Experiência",
  "portfolio": "Portfólio",
  "workExperience": "Experiência de Trabalho",
  "aboutMe": "Sobre mim",
  "educationHistory": "História Educacional",
  "myExperience": "Minha experiência",
  "skills": "Competências",
  "experiences": [
    {
      "title": "Desenvolvedor Full Stack Freelancer",
      "period": "Fevereiro 2024 – Hoje",
      "companyName": "",
      "companyDescription": "",
      "experienceDescription": "Eu pude agregar valor realizando integração de meio de pagamento com cartão de crédito E-Rede para a empresa Elevar.",
      "skills": "Desenvolvimento Java, Node.js, Angular (Framework), Angular Js, SQL Server, Spring Boot, Git, GitLab."
    },
    {
      "title": "Desenvolvedor Full Stack na Elevar",
      "period": "Outubro 2022 – Janeiro 2024",
      "companyName": "Elevar Commerce",
      "companyDescription": "é uma empresa que oferece plataforma de e-commerce e soluções para ajudar negócios a expandir e ter sucesso online.",
      "experienceDescription": "Pude contribuir com o desenvolvimento de promoções personalizadas, banners de seção trabalhando com Java, Angular e SQL Server, criação de micro serviço de frete melhorando a experiência do usuário através do Node documentado com Swagger e aprimorei os processos de entrega de software através de pipelines de Merge Request.",
      "skills": "Interface de programação de aplicativos (API), Java, Ionic Framework, Node.js, Git, API REST, Integração e entrega contínuas (CI/CD), Angular Js, Spring Boot, Angular (Framework), AngularJS, Microsoft SQL Server."
    },
    {
      "title": "Estágio em Desenvolvimento Web na Elevar",
      "period": "Fevereiro 2022 – Setembro 2022",
      "companyName": "Elevar Commerce",
      "companyDescription": "é uma empresa que oferece plataforma de e-commerce e soluções para ajudar negócios a expandir e ter sucesso online.",
      "experienceDescription": "Como estagiário pude experienciar o trabalho com Metodologias Ágeis, versionamento de código, trabalho em equipe e tecnologias JavaScript e TypeScript utilizando Angular, Ionic e Node, e também com Java na parte de backend.",
      "skills": "Java, Ionic Framework, Git, Angular (Framework), AngularJS, Microsoft SQL Server."
    }
  ],
  "educationalHistory": [
    {
      "title": "Arquitetura de Software Distribuído",
      "institution": "PUC Minas",
      "period": "Março 2024 – Hoje",
      "educationDescription": "Este curso tem um papel estratégico na formação profissional de quem almeja uma carreira como arquiteto de software. Ele foi idealizado de modo a prover habilidades e competências para formação avançada dos profissionais que atuam na concepção, construção e implantação de softwares que usam aspectos de arquitetura de software em ambientes distribuídos."
    },
    {
      "title": "Bacharel em Ciência da Computação",
      "institution": "Instituto Federal de Educação, Ciência e Tecnologia do Ceará",
      "period": "2019 – 2023",
       "educationDescription": "O curso de Bacharelado em Ciência da Computação visa a formação de profissionais em bases científica, técnica, ética e humanista, condizentes com a especificidade da área de Ciência da Computação, aliado à formação prática, através do desenvolvimento de projetos e do domínio de tecnologias computacionais. O bacharel em Ciência da Computação atua em áreas vinculadas a empreendedorismo, pesquisa, consultoria, organizações públicas, privadas e do terceiro setor e atuação em carreira acadêmica."
    },
    {
      "title": "Técnico em Informática",
      "institution": "EEEP Professora Luíza de Teodoro Vieira",
      "period": "2014 – 2016",
      "educationDescription": "O objetivo é formar profissionais de nível médio para atuar na criação, produção e instalação de tecnologias de comunicação e informação, articulando educação, trabalho, ciência e tecnologia. A formação deve promover o desenvolvimento contínuo, oferecendo situações de ensino que alinhem competências laborais com a realidade regional, capacitando os profissionais para desempenhar suas atividades eficientemente. Além disso, busca-se conscientizar sobre a importância da formação contínua e possibilitar a certificação de conhecimentos adquiridos profissionalmente para a continuidade dos estudos."
    }
  ]
}